{
  "aligner_config": {
    "cls": "MlpProjector",
    "model_type": "aligner",
    "params": {
      "depth": 2,
      "input_dim": 1024,
      "n_embed": 2048,
      "projector_type": "mlp_gelu"
    }
  },
  "architectures": [
    "MultiModalityCausalLM"
  ],
  "bos_token_id": 100000,
  "dtype": "bfloat16",
  "eos_token_id": 100001,
  "gen_aligner_config": {
    "cls": "MlpProjector",
    "model_type": "gen_aligner",
    "params": {
      "depth": 2,
      "input_dim": 8,
      "n_embed": 2048,
      "projector_type": "mlp_gelu"
    }
  },
  "gen_head_config": {
    "cls": "vision_head",
    "model_type": "gen_head",
    "params": {
      "image_token_embed": 2048,
      "image_token_size": 16384,
      "n_embed": 2048
    }
  },
  "gen_vision_config": {
    "cls": "VQ-16",
    "model_type": "gen_vision",
    "params": {
      "image_token_size": 16384,
      "n_embed": 8
    }
  },
  "hidden_size": 2048,
  "language_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "dtype": "bfloat16",
    "eos_token_id": 2,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 5632,
    "max_position_embeddings": 16384,
    "mlp_bias": false,
    "model_type": "llama",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "num_key_value_heads": 16,
    "pad_token_id": null,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "rope_theta": 10000.0,
      "rope_type": "default"
    },
    "tie_word_embeddings": false,
    "use_cache": true,
    "vocab_size": 102400
  },
  "model_type": "multi_modality",
  "pad_token_id": 100002,
  "transformers_version": "5.4.0",
  "use_cache": false,
  "vision_config": {
    "cls": "CLIPVisionTower",
    "model_type": "vision",
    "params": {
      "image_size": 384,
      "model_name": "siglip_large_patch16_384",
      "select_feature": "same",
      "select_layer": -1
    }
  }
}
