{
  "add_prefix_space": null,
  "backend": "tokenizers",
  "bos_token": "<пЅњbeginв–Ѓofв–ЃsentenceпЅњ>",
  "clean_up_tokenization_spaces": false,
  "eos_token": "<пЅњendв–Ѓofв–ЃsentenceпЅњ>",
  "extra_special_tokens": [
    "<image_placeholder>",
    "<patch_placeholder>",
    "<|ref|>",
    "<|/ref|>",
    "<|det|>",
    "<|/det|>",
    "<|grounding|>",
    "<|User|>",
    "<|Assistant|>"
  ],
  "is_local": false,
  "model_max_length": 16384,
  "pad_token": "<пЅњв–Ѓpadв–ЃпЅњ>",
  "processor_class": "VLChatProcessor",
  "tokenizer_class": "LlamaTokenizer",
  "unk_token": null,
  "use_default_system_prompt": true
}
